{
  "title": "Conditions Générales d'Utilisation",
  "version": "1.0",
  "lastUpdated": "2023-03-30",
  "sections": [
    {
      "title": "Introduction",
      "content": [
        "Bienvenue sur Cinéfile, une application de découverte de films. Ces Conditions Générales d'Utilisation (CGU) régissent l'utilisation de l'application et définissent les termes et conditions auxquels vous êtes soumis en utilisant l'application."
      ]
    },
    {
      "title": "Utilisation de l'application",
      "content": [
        "En utilisant l'application Cinéfile, vous acceptez de vous conformer à ces CGU, ainsi qu'à toutes les lois et réglementations applicables.",
        "Vous vous engagez à ne pas utiliser l'application à des fins illicites ou dans un but frauduleux.",
        "Vous acceptez également de ne pas utiliser l'application pour collecter des informations sur d'autres utilisateurs ou pour leur envoyer des messages non sollicités.",
        "L'application Cinéfile se réserve le droit de suspendre ou de résilier votre compte à tout moment si vous enfreignez ces CGU ou si vous utilisez l'application de manière abusive."
      ]
    },
    {
      "title": "Compte utilisateur",
      "content": [
        "L'application Cinéfile permet de créer un compte utilisateur pour sauvegarder vos favoris et accéder à d'autres fonctionnalités personnalisées.",
        "Vous êtes responsable de la confidentialité de votre compte utilisateur et de votre mot de passe.",
        "Vous vous engagez à ne pas partager votre compte utilisateur ou vos informations de connexion avec d'autres personnes.",
        "En cas de perte ou de vol de votre compte utilisateur, vous devez immédiatement contacter le support de l'application pour signaler le problème et prendre les mesures nécessaires pour récupérer votre compte."
      ]
    },
    {
      "title": "Données personnelles",
      "content": [
        "L'application Cinéfile collecte certaines données personnelles vous concernant, telles que votre nom, votre adresse e-mail et vos préférences de films.",
        "Ces données sont utilisées pour améliorer l'expérience utilisateur de l'application et vous fournir des fonctionnalités personnalisées.",
        "L'application Cinéfile s'engage à protéger vos données personnelles et à respecter votre vie privée conformément à la réglementation en vigueur.",
        "Vous pouvez à tout moment accéder à vos données personnelles, les modifier ou les supprimer en contactant le support de l'application."
      ]
    },
    {
      "title": "Propriété intellectuelle",
      "content": [
        "Tous les droits de propriété intellectuelle relatifs à l'application Cinéfile, y compris les droits d'auteur et les marques commerciales, sont réservés à l'éditeur de l'application.",
        "En utilisant l'application Cinéfile, vous acceptez de ne pas utiliser les éléments de propriété intellectuelle de l'application à des fins autres que l'utilisation de l'application elle-même.",
        "Vous ne pouvez pas reproduire, modifier, distribuer ou vendre tout ou partie de l'application sans l'autorisation écrite préalable de l'éditeur de l'application."
      ]
    },
    {
      "title": "6. Responsabilité",
      "content": [
        "Cinéfile s'efforce de fournir une application de qualité, mais ne peut garantir que l'application sera exempte d'erreurs ou d'interruptions de service. Vous utilisez l'application Cinéfile à vos propres risques et périls. En aucun cas, Cinéfile ne pourra être tenue responsable de tout dommage résultant de l'utilisation de l'application ou de l'impossibilité d'y accéder. En outre, Cinéfile ne pourra être tenue responsable des contenus accessibles à partir de liens hypertextes présents sur l'application."
      ]
    },
    {
      "title": "7. Modification des CGU",
      "content": [
        "Cinéfile se réserve le droit de modifier à tout moment les présentes CGU. L'utilisateur sera informé de ces modifications par tout moyen jugé approprié par Cinéfile."
      ]
    }
  ]
}
